'use strict';

var data = [];

var list = [
  // เมนูไก่สับ
  ['ไก่สับจานเล็ก', '90','img','','เมนูไก่สับ'], 
  ['ไก่สับจานกลาง','120','img','','เมนูไก่สับ'], 
  ['ไก่สับจานใหญ่','250','img','','เมนูไก่สับ'],
  // เมนูก๋วยเตี๋ยวไก่
  ['ก๋วยเตี๋ยวไก่ฉีก','40','','','เมนูก๋วยเตี๋ยวไก่'],
  ['ก๋วยเตี๋ยวไก่ตุ่น','40','','','เมนูก๋วยเตี๋ยวไก่'],
  ['เกาเหลา (ธรรมดาหรือต้มยำ)','40','','','เมนูก๋วยเตี๋ยวไก่'],
  ['พิเศษ เพิ่มนอง','60','','','เมนูก๋วยเตี๋ยวไก่'],
  // เมนูข้าวมันไก่
  ['ข้าวมันไก่ สูตรเบตง','50','','',''],
  ['ข้าวมันไก่ สูตรเบตง พิเศษ','60','','',''],
// เมนูเครื่องดื่ม
  ['น้ำเปล่า','10','','','เมนูเครื่องดื่ม'],
  ['โค้ก','20','','','เมนูเครื่องดื่ม'],
  ['น้ำชาดำ','20','','','เมนูเครื่องดื่ม'],
  ['น้ำอัญชัญ','20','','','เมนูเครื่องดื่ม'],
  ['น้ำกระเจี๊ยบ','20','','','เมนูเครื่องดื่ม'],
  ['น้ำเก็กฮวย','20','','','เมนูเครื่องดื่ม'],

//เมนูโจ็กตงตง
  ['โจ็กหมูเด้ง, ไก่ฉีก ,ไก่บ้าน','45','','','เมนูโจ็กตงตง'],
  ['โจ็กข้าวไรซ์เบอร์รี่','55','','','เมนูโจ็กตงตง'],
  ['เพิ่มไก่ตุ๋น','20','','','เมนูโจ็กตงตง'],
  ['เพิ่มหมูเด้ง','20','','','เมนูโจ็กตงตง'],
  ['เพิ่มหมู่ตุ๋น','20','','','เมนูโจ็กตงตง'],
  ['เพิ่มไก่สับ','20','','','เมนูโจ็กตงตง'],
  ['เพิ่มไก่ฉีก','20','','','เมนูโจ็กตงตง'],



  ['ฮ่องเต้น้ำมันหอย','','','',''],
  ['หมูกรอบฮ่องกง','','','',''],
  ['ไก่ฮ่องเต้','','','',''],
  ['สี่สหาย','','','',''],
  


];
for (var i = 0; i < list.length; i++) {
  data[i] = {
    id: '',
    name:list[i][0],
    price:list[i][1],
    image:list[i][2],
    des:list[i][3],
    type:list[i][4],
    created_at: new Date(),
    updated_at: new Date()
  };
}
module.exports = {
  up: (queryInterface, Sequelize) => {
    /*
      Add altering commands here.
      Return a promise to correctly handle asynchronicity.
    */
    return queryInterface.bulkInsert('foods', data, {});
  },

  down: (queryInterface, Sequelize) => {
    /*
      Add reverting commands here.
      Return a promise to correctly handle asynchronicity.
      Example:
      return queryInterface.bulkDelete('Person', null, {});
    */
  }
};